# -*- coding: utf-8 -*-
def stops1
  ["大井町駅","下神明駅","戸越公園駅","中延駅","荏原町駅","旗の台駅","北千束駅","大岡山駅","緑が丘駅","自由が丘駅","九品仏駅","尾山台駅","等々力駅","上野毛駅","二子玉川駅","溝の口駅"]
end
def stops2
  ["渋谷駅","池尻大橋駅","三軒茶屋駅","駒沢大学駅","桜新町駅","用賀駅","二子玉川駅","二子新地駅","高津駅","溝の口駅","梶が谷駅","宮崎台駅","宮前平駅","鷺沼駅","たまプラーザ駅","あざみ野駅","江田駅","市が尾駅","藤が丘駅","青葉台駅","田奈駅","長津田駅","つくし野駅","すずかけ台駅","南町田駅","つきみ野駅","中央林間駅"]
end

t=stops1
s=stops2

def find(a,b)
  for i in 0..a.length-1
    if j=b.index(a[i])
      return [i,j]  
    end
  end
end

def join(a,b)
  i,j=find(a,b)
  a[0..i]+b[j+1..-1]
end

k=join(t,s)
print k*",",""



